phucttp/sd-flash-esp32/main/flasher/flasher.cpp
	// --- KHỞI TẠO CRYPTO ---
	flasher_crypto_ctx_t crypto = {0};
	if (flasher_crypto_init(&crypto) != ESP_OK) {
		ESP_LOGE(TAG, "Failed to initialize crypto context");
		fwFile.close();
		return ESP_FAIL;
	}

	// --- BẮT ĐẦU GHI FLASH ---
	// Gửi lệnh báo cho target biết sắp ghi phân vùng
	// Lưu ý: total_size là kích thước file mã hóa, có thể lớn hơn kích thước thật do padding
	esp_loader_error_t err = esp_loader_flash_start(offset, total_size, BUFFER_SIZE);
	if (err != ESP_LOADER_SUCCESS) {
		ESP_LOGE(TAG, "Failed to start flash for encrypted segment. err=%d", err);
		flasher_crypto_cleanup(&crypto);
		fwFile.close();
		return ESP_FAIL;
	}

	// Cấp phát bộ đệm kép (encrypted input, decrypted output)
	uint8_t* buffer_enc = (uint8_t*) malloc(BUFFER_SIZE);
	uint8_t* buffer_dec = (uint8_t*) malloc(BUFFER_SIZE);
	if (!buffer_enc || !buffer_dec) {
		ESP_LOGE(TAG, "Failed to allocate buffers!");
		if (buffer_enc) free(buffer_enc);
		if (buffer_dec) free(buffer_dec);
		flasher_crypto_cleanup(&crypto);
		fwFile.close();
		return ESP_ERR_NO_MEM;
	}

	size_t bytes_written = 0;
	size_t bytes_read = 0;

	// Đọc từng khối dữ liệu mã hóa, giải mã và ghi vào flash của Target
	while ((bytes_read = fwFile.read(buffer_enc, BUFFER_SIZE)) > 0) {
		// Giải mã chunk
		size_t dec_len = 0;
		if (flasher_crypto_decrypt(&crypto, buffer_enc, bytes_read, buffer_dec, &dec_len) != ESP_OK) {
			ESP_LOGE(TAG, "Decrypt error at offset %zu", bytes_written);
			break;
		}

		if (dec_len > 0) {
			// Ghi khối dữ liệu đã giải mã vào flash
			err = esp_loader_flash_write(buffer_dec, dec_len);
			if (err != ESP_LOADER_SUCCESS) {
				ESP_LOGE(TAG, "Write error at offset %zu (err=%d)", bytes_written, err);
				break;
			}
			bytes_written += dec_len;
		}

		// Tính toán và hiển thị tiến trình nạp
		uint32_t progress = (uint32_t)((bytes_written * 100) / total_size);

		// Cập nhật progress bar (mỗi 2% để giảm flicker)
		static uint32_t last_enc_progress = 0;
		if (progress != last_enc_progress && progress % 10 == 0) {
			last_enc_progress = progress;
			ESP_LOGI(TAG, "Decrypt+Flash: %" PRIu32 "%%", progress);
			// Hiển thị progress bar với icon khóa
			String title = String("") + file_path.c_str();
			ui.showProgress(title.c_str(), (int)progress);
		}
	}

	// Dọn dẹp
	free(buffer_enc);
	free(buffer_dec);
	flasher_crypto_cleanup(&crypto);
	fwFile.close();

	ESP_LOGI(TAG, "Encrypted segment written %zu bytes OK", bytes_written);

	// --- KIỂM TRA MD5 (NẾU CÓ) ---
	// Lưu ý: MD5 phải là hash của dữ liệu đã giải mã (plaintext)
	if (md5.length() == 32) {
		char md5_ascii[33];
		strncpy(md5_ascii, md5.c_str(), 32);
		md5_ascii[32] = '\0';

		err = esp_loader_flash_verify_known_md5(offset, bytes_written, (const uint8_t*) md5_ascii);
		if (err != ESP_LOADER_SUCCESS) {
			ESP_LOGE(TAG, "MD5 check failed for encrypted segment!");
			return ESP_FAIL;
		}
		ESP_LOGI(TAG, "MD5 verified OK for encrypted segment!");
	} else {
		ESP_LOGW(TAG, "No valid MD5 provided, skipping verification.");
	}

	ESP_LOGI(TAG, "Encrypted segment at 0x%08" PRIx32 " written successfully.", offset);
	return ESP_OK;
}

/**
 * @brief Bắt đầu toàn bộ phiên nạp firmware: kết nối, nạp 3 phân vùng, và reset.
 * @param fw_id ID của firmware (dùng để tìm metadata file).
 * @return ESP_OK nếu toàn bộ quá trình thành công.
 */
esp_err_t flasher_begin_session(const std::string& fw_id)
{
	firmware_metadata_t metadata;

	// --- BƯỚC 1: LẤY THÔNG TIN FILE TỪ SD CARD ---
	// Lấy đường dẫn và MD5 của bootloader, partition table và app
	esp_err_t ret = sd_get_firmware_path(fw_id, metadata);
	if (ret != ESP_OK) {
		ESP_LOGE(TAG, "Failed to get firmware metadata for fw_id: %s", fw_id.c_str());
		return ret;
	}

	if (try_connect() != ESP_OK) {
		ESP_LOGE(TAG, "Failed to connect to target.");
		ui.showMessage("Flash Session", "connect failed.");
		vTaskDelay(pdMS_TO_TICKS(500));
		return ESP_FAIL;
	} else {
		ESP_LOGI(TAG, "Connected to target successfully.");
		ui.showMessage("Flash Session", "connected.");
	}

	// --- BƯỚC 3: BOOST BAUDRATE ---
	uint32_t new_baud = 921600; // Tăng tốc lên 921600bps
	// Gửi lệnh thay đổi baudrate đến target
	esp_loader_error_t err_baud = esp_loader_change_transmission_rate(new_baud);
	if (err_baud == ESP_LOADER_SUCCESS) {
		// Nếu target chấp nhận, host (ESP32-C3) cũng phải thay đổi baudrate UART
		uart_set_baudrate(UART_NUM_1, new_baud);
		ESP_LOGI(TAG, "Baudrate boosted to %lu", new_baud);
	} else {
		ESP_LOGW(TAG, "Baudrate boost failed (err=%d), continue at 115200", err_baud);
	}


	// --- BƯỚC 4: GHI TỪNG PHÂN VÙNG THEO THỨ TỰ ---
	// Chọn hàm flash dựa trên flag encrypted
	if (metadata.encrypted) {
		ESP_LOGI(TAG, ">>> ENCRYPTED FLASH MODE <<<");
		ui.showMessage("Flash Mode", "ENCRYPTED");
		vTaskDelay(pdMS_TO_TICKS(500));

		// 4a. Nạp bootloader mã hóa (Offset: 0x1000)
		ret = flasher_write_segment_encrypted(metadata.path_bootloader, ESP_BOOTLOADER_ADDR, metadata.md5_bootloader);
		if (ret != ESP_OK) return ret;

		// 4b. Nạp partition table mã hóa (Offset: 0x8000)
		ret = flasher_write_segment_encrypted(metadata.path_partition, ESP_PARTITION_ADDR, metadata.md5_partition);
		if (ret != ESP_OK) return ret;

		// 4c. Nạp firmware chính mã hóa (Offset: 0x10000)
		ret = flasher_write_segment_encrypted(metadata.path, ESP_APPLICATION_ADDR, metadata.md5);
		if (ret != ESP_OK) return ret;
	} else {
		ESP_LOGI(TAG, ">>> PLAIN FLASH MODE <<<");

		// 4a. Nạp bootloader (Offset: 0x1000)
		ret = flasher_write_segment(metadata.path_bootloader, ESP_BOOTLOADER_ADDR, metadata.md5_bootloader);
		if (ret != ESP_OK) return ret;

		// 4b. Nạp partition table (Offset: 0x8000)
		ret = flasher_write_segment(metadata.path_partition, ESP_PARTITION_ADDR, metadata.md5_partition);
		if (ret != ESP_OK) return ret;

		// 4c. Nạp firmware chính (Offset: 0x10000)
		ret = flasher_write_segment(metadata.path, ESP_APPLICATION_ADDR, metadata.md5);
		if (ret != ESP_OK) return ret;
	}

	// --- BƯỚC 5: RESET TARGET VỀ CHẾ ĐỘ THƯỜNG ---
	esp_loader_reset_target();
	ESP_LOGI(TAG, "Resetting target to run app...");
	vTaskDelay(pdMS_TO_TICKS(200));

