phucttp/sd-flash-esp32/main/flasher/flasher.cpp
	ESP_LOGI(TAG, "Target restarted in normal mode.");
	ESP_LOGI(TAG, "Full firmware update completed successfully!");
	// sd_unmount(); // Giải phóng thẻ SD sau khi nạp xong
	host_system_restart(); // Khởi động lại host để giải phóng bộ nhớ
	return ESP_OK;
}


/**
 * @brief Reset sequence kiểu esptool - brute force thử tất cả logic combinations
 * @param config Cấu hình GPIO
 * @param reset_invert 0=direct (LOW=LOW), 1=transistor (HIGH=LOW)
 * @param boot_invert 0=direct (LOW=LOW), 1=transistor (HIGH=LOW)
 */
static void do_reset_sequence(const loader_esp32_config_t *config, int reset_invert, int boot_invert, uint32_t reset_ms, uint32_t boot_ms)
{
	int reset_active = reset_invert ? 1 : 0;
	int reset_idle = reset_invert ? 0 : 1;
	int boot_active = boot_invert ? 1 : 0;
	int boot_idle = boot_invert ? 0 : 1;

	// Step 1: Set GPIO0 to boot mode (active = LOW on target)
	gpio_set_level((gpio_num_t)config->gpio0_trigger_pin, boot_active);
	vTaskDelay(pdMS_TO_TICKS(50));

	// Step 2: Pulse reset
	gpio_set_level((gpio_num_t)config->reset_trigger_pin, reset_active);  // EN = LOW
	vTaskDelay(pdMS_TO_TICKS(reset_ms));
	gpio_set_level((gpio_num_t)config->reset_trigger_pin, reset_idle);    // EN = HIGH

	// Step 3: Hold GPIO0 for boot sampling
	vTaskDelay(pdMS_TO_TICKS(boot_ms));

	// Step 4: Release GPIO0
	gpio_set_level((gpio_num_t)config->gpio0_trigger_pin, boot_idle);
}

/**
 * @brief Brute force try tất cả GPIO logic combinations như esptool
 * @return ESP_OK nếu kết nối thành công
 */
static esp_err_t try_all_reset_combinations(const loader_esp32_config_t *config)
{
	gpio_set_direction((gpio_num_t)config->gpio0_trigger_pin, GPIO_MODE_OUTPUT);
	gpio_set_direction((gpio_num_t)config->reset_trigger_pin, GPIO_MODE_OUTPUT);

	esp_loader_connect_args_t connect_config = ESP_LOADER_CONNECT_DEFAULT();

	// 4 combinations: (reset_invert, boot_invert)
	// 0,0 = both direct
	// 0,1 = reset direct, boot transistor
	// 1,0 = reset transistor, boot direct
	// 1,1 = both transistor
	const int combinations[4][2] = {
		{1, 1},  // Both transistor (most common for autoboot boards)
		{1, 0},  // Reset transistor, Boot direct
		{0, 1},  // Reset direct, Boot transistor
		{0, 0},  // Both direct
	};
	const char* combo_names[4] = {
		"RST=inv, BOOT=inv",
		"RST=inv, BOOT=dir",
		"RST=dir, BOOT=inv",
		"RST=dir, BOOT=dir",
	};

	// Timing variations
	const uint32_t timings[3][2] = {
		{100, 50},   // Fast
		{100, 100},  // Normal
		{200, 200},  // Slow
	};

	// Animation: spinning chars + attempt counter
	const char spinner[] = "|/-\\";
	int attempt = 0;
	const int totalAttempts = 12;  // 3 timings x 4 combos

	for (int t = 0; t < 3; t++) {
		for (int c = 0; c < 4; c++) {
			attempt++;

			// [ANIMATION] Hiển thị tiến trình kết nối
			char line1[22];
			char line2[22];
			snprintf(line1, sizeof(line1), "Connecting %c", spinner[attempt % 4]);
			snprintf(line2, sizeof(line2), "Try %d/%d...", attempt, totalAttempts);
			ui.showMessage(line1, line2);

			ESP_LOGI(TAG, "Trying [%d/%d]: %s, timing=%lu/%lu ms",
			         attempt, totalAttempts, combo_names[c], timings[t][0], timings[t][1]);

			// Release all first
			gpio_set_level((gpio_num_t)config->gpio0_trigger_pin, combinations[c][1] ? 0 : 1);
			gpio_set_level((gpio_num_t)config->reset_trigger_pin, combinations[c][0] ? 0 : 1);
			vTaskDelay(pdMS_TO_TICKS(100));

			// Do reset sequence
			do_reset_sequence(config, combinations[c][0], combinations[c][1],
			                  timings[t][0], timings[t][1]);

			// Flush UART
			uart_flush(config->uart_port);
			uart_flush_input(config->uart_port);
			vTaskDelay(pdMS_TO_TICKS(50));

			// Try connect
			if (esp_loader_connect(&connect_config) == ESP_LOADER_SUCCESS) {
				ESP_LOGI(TAG, "SUCCESS! Working combination: %s, timing=%lu/%lu",
				         combo_names[c], timings[t][0], timings[t][1]);
				ui.showMessage("Connected!", "Success");
				return ESP_OK;
			}

			ESP_LOGW(TAG, "Failed, trying next...");
			vTaskDelay(pdMS_TO_TICKS(100));
		}
	}

	ESP_LOGE(TAG, "All combinations failed!");
	return ESP_FAIL;
}

/**
 * @brief Xóa toàn bộ flash của chip Target.
 * @return ESP_OK nếu xóa thành công.
 */
esp_err_t flasher_chip_erase() {
	ESP_LOGI(TAG, "--- START CHIP ERASE ---");

	// 1. Handshake với Target (tự động thử các timing profiles)
	if (try_connect() != ESP_OK) {
		ESP_LOGE(TAG, "Failed to connect to target for erase.");
		ui.showMessage("Erasing Chip", "failed to connect.");
		return ESP_FAIL;
	}
	ESP_LOGI(TAG, "Connected. Erasing chip (please wait)...");
	ui.showMessage("Erasing Chip", "connected.");

	// 2. Gọi lệnh xóa toàn bộ (Hàm này sẽ BLOCK cho đến khi xóa xong, có thể mất vài giây)
	ui.showMessage("Erasing Chip", "erasing...");
	esp_loader_error_t err = esp_loader_flash_erase();
	if (err != ESP_LOADER_SUCCESS) {
		ESP_LOGE(TAG, "Chip erase failed with error: %d", err);
		ui.showMessage("Erasing Chip", "erase failed!");
		return ESP_FAIL;
	}

	ESP_LOGI(TAG, "Chip erase completed successfully!");
	ui.showMessage("Erasing Chip", "SUCCESS!");

	// 3. Reset target lại để target chạy lại app (hoặc chỉ chạy bootloader nếu chưa có app)
	esp_loader_reset_target();

	// 4. Khởi động lại host để giải phóng bộ nhớ
	host_system_restart();
	return ESP_OK;
}

/**
 * @brief Hiển thị thông báo và khởi động lại ESP32 Host.
 */
void host_system_restart() {
	ESP_LOGI(TAG, "Dang khoi dong lai he thong...");

	// Hiệu ứng dấu chấm động: Restarting. -> Restarting.. -> Restarting...
	for (int i = 1; i <= 3; i++) {
		std::string dots(i, '.'); // Tạo chuỗi chứa i dấu chấm
		ui.showMessage("Restarting", dots.c_str());
		vTaskDelay(pdMS_TO_TICKS(200));
	}

	// Gọi hàm khởi động lại hệ thống ESP-IDF
	esp_restart();
}

// ============================================================
// SCAN BOOT API - Save/Load boot combo config
// ============================================================

/**
 * @brief Lưu combo index vào file trên SD
 */
static void save_combo_to_sd(int combo_index) {
	// Tạo thư mục config nếu chưa có
	if (!SD.exists("/config")) {
		SD.mkdir("/config");
	}

	File f = SD.open(BOOT_CONFIG_PATH, FILE_WRITE);
	if (f) {
		f.printf("%d\n", combo_index);
		f.close();
		ESP_LOGI(TAG, "Saved boot combo #%d to SD", combo_index);
		g_saved_combo = combo_index;
		g_combo_loaded = true;
	} else {
		ESP_LOGE(TAG, "Failed to save boot config to SD");
	}
}

/**
 * @brief Load combo index từ file trên SD
 */
int flasher_load_saved_combo(void) {
	if (g_combo_loaded) {
		return g_saved_combo;
	}

	if (!SD.exists(BOOT_CONFIG_PATH)) {
		ESP_LOGI(TAG, "No saved boot config found");
		g_saved_combo = -1;
		g_combo_loaded = true;
		return -1;
	}

	File f = SD.open(BOOT_CONFIG_PATH, FILE_READ);
	if (!f) {
		ESP_LOGE(TAG, "Failed to open boot config");
		g_saved_combo = -1;
		g_combo_loaded = true;
		return -1;
	}

	String line = f.readStringUntil('\n');
	f.close();

	int combo = line.toInt();
	if (combo >= 0 && combo < 12) {
		ESP_LOGI(TAG, "Loaded saved boot combo #%d", combo);
		g_saved_combo = combo;
	} else {
		ESP_LOGW(TAG, "Invalid combo value in config: %d", combo);
		g_saved_combo = -1;
	}
	g_combo_loaded = true;
	return g_saved_combo;
}

/**
 * @brief Xóa combo đã lưu
 */
void flasher_clear_saved_combo(void) {
	if (SD.exists(BOOT_CONFIG_PATH)) {
		SD.remove(BOOT_CONFIG_PATH);
		ESP_LOGI(TAG, "Cleared saved boot config");
	}
	g_saved_combo = -1;
	g_combo_loaded = true;
}

/**
 * @brief Thử kết nối với combo cụ thể
 * @param combo_index Index combo (0-11)
 * @return ESP_OK nếu thành công
 */
static esp_err_t try_connect_with_combo(int combo_index) {
	const int combinations[4][2] = {
		{1, 1}, {1, 0}, {0, 1}, {0, 0}
	};
	const uint32_t timings[3][2] = {
		{100, 50}, {100, 100}, {200, 200}
	};

	int t = combo_index / 4;  // timing index (0-2)
	int c = combo_index % 4;  // combo index (0-3)

	gpio_set_direction((gpio_num_t)config.gpio0_trigger_pin, GPIO_MODE_OUTPUT);
	gpio_set_direction((gpio_num_t)config.reset_trigger_pin, GPIO_MODE_OUTPUT);

	ESP_LOGI(TAG, "Trying saved combo #%d (timing=%lu/%lu)",
	         combo_index, timings[t][0], timings[t][1]);

	// Release all first
	gpio_set_level((gpio_num_t)config.gpio0_trigger_pin, combinations[c][1] ? 0 : 1);
	gpio_set_level((gpio_num_t)config.reset_trigger_pin, combinations[c][0] ? 0 : 1);
	vTaskDelay(pdMS_TO_TICKS(100));

	// Do reset sequence
	do_reset_sequence(&config, combinations[c][0], combinations[c][1],
	                  timings[t][0], timings[t][1]);

	// Flush UART
	uart_flush(config.uart_port);
	uart_flush_input(config.uart_port);
	vTaskDelay(pdMS_TO_TICKS(50));

	// Try connect
	esp_loader_connect_args_t connect_config = ESP_LOADER_CONNECT_DEFAULT();
	if (esp_loader_connect(&connect_config) == ESP_LOADER_SUCCESS) {
		ESP_LOGI(TAG, "Connected with saved combo #%d!", combo_index);
		return ESP_OK;
	}

