phucttp/sd-flash-esp32/main/flasher/flasher.cpp
	return ESP_FAIL;
}

/**
 * @brief Scan tất cả combo và lưu combo working
 */
int flasher_scan_and_save_combo(void) {
	gpio_set_direction((gpio_num_t)config.gpio0_trigger_pin, GPIO_MODE_OUTPUT);
	gpio_set_direction((gpio_num_t)config.reset_trigger_pin, GPIO_MODE_OUTPUT);

	esp_loader_connect_args_t connect_config = ESP_LOADER_CONNECT_DEFAULT();

	const int combinations[4][2] = {
		{1, 1}, {1, 0}, {0, 1}, {0, 0}
	};
	const char* combo_names[4] = {
		"RST=inv,BOOT=inv",
		"RST=inv,BOOT=dir",
		"RST=dir,BOOT=inv",
		"RST=dir,BOOT=dir"
	};
	const uint32_t timings[3][2] = {
		{100, 50}, {100, 100}, {200, 200}
	};

	const char spinner[] = "|/-\\";
	int attempt = 0;
	const int totalAttempts = 12;

	for (int t = 0; t < 3; t++) {
		for (int c = 0; c < 4; c++) {
			int combo_index = t * 4 + c;
			attempt++;

			// Animation
			char line1[22];
			char line2[22];
			snprintf(line1, sizeof(line1), "Scanning %c", spinner[attempt % 4]);
			snprintf(line2, sizeof(line2), "Try %d/%d...", attempt, totalAttempts);
			ui.showMessage(line1, line2);

			ESP_LOGI(TAG, "Scan [%d/%d]: %s, timing=%lu/%lu",
			         attempt, totalAttempts, combo_names[c], timings[t][0], timings[t][1]);

			// Release all first
			gpio_set_level((gpio_num_t)config.gpio0_trigger_pin, combinations[c][1] ? 0 : 1);
			gpio_set_level((gpio_num_t)config.reset_trigger_pin, combinations[c][0] ? 0 : 1);
			vTaskDelay(pdMS_TO_TICKS(100));

			do_reset_sequence(&config, combinations[c][0], combinations[c][1],
			                  timings[t][0], timings[t][1]);

			uart_flush(config.uart_port);
			uart_flush_input(config.uart_port);
			vTaskDelay(pdMS_TO_TICKS(50));

			if (esp_loader_connect(&connect_config) == ESP_LOADER_SUCCESS) {
				ESP_LOGI(TAG, "FOUND! Combo #%d: %s, timing=%lu/%lu",
				         combo_index, combo_names[c], timings[t][0], timings[t][1]);

				// Lưu combo vào SD
				save_combo_to_sd(combo_index);

				ui.showMessage("FOUND!", line2);
				vTaskDelay(pdMS_TO_TICKS(500));

				// Reset target để thoát bootloader
				esp_loader_reset_target();

				return combo_index;
			}

			vTaskDelay(pdMS_TO_TICKS(100));
		}
	}

	ESP_LOGE(TAG, "Scan failed - no working combo found!");
	return -1;
}

static esp_err_t try_connect(void) {
	// --- ƯU TIÊN: Thử saved combo trước ---
	int saved = flasher_load_saved_combo();
	if (saved >= 0) {
		ESP_LOGI(TAG, "=== FAST CONNECT (saved combo #%d) ===", saved);
		ui.showMessage("Connecting...", "Using saved cfg");

		if (try_connect_with_combo(saved) == ESP_OK) {
			ui.showMessage("Connected!", "Fast mode");
			vTaskDelay(pdMS_TO_TICKS(300));
			return ESP_OK;
		}

		// Saved combo failed -> clear và thử brute force
		ESP_LOGW(TAG, "Saved combo failed, clearing and trying brute force...");
		flasher_clear_saved_combo();
	}

	// --- BRUTE FORCE: Thử tất cả GPIO logic combinations ---
	ESP_LOGI(TAG, "=== BRUTE FORCE CONNECT (esptool style) ===");

	esp_err_t result = try_all_reset_combinations(&config);

	if (result == ESP_OK) {
		vTaskDelay(pdMS_TO_TICKS(300));  // Cho user thấy "Connected!"
		return ESP_OK;
	} else {
		ESP_LOGE(TAG, "All reset combinations failed!");
		ui.showMessage("FAILED!", "Check wiring");
		vTaskDelay(pdMS_TO_TICKS(1500));
		return ESP_FAIL;
	}
}